apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_i2c.h
/****************************************************************************************************
 * arch/arm/src/lpc54xx/lpc54_i2c.h
 *
 *   Copyright (C) 2017 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************************/

#ifndef __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_I2C_H
#define __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_I2C_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>
#include "chip/lpc54_memorymap.h"

/****************************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************************/

/* Register offsets *********************************************************************************/

/* Shared I2C registers */

#define LPC54_I2C_CFG_OFFSET        0x0800  /* Configuration for shared functions */
#define LPC54_I2C_STAT_OFFSET       0x0804  /* Status register for shared functions */
#define LPC54_I2C_INTENSET_OFFSET   0x0808  /* Interrupt enable set and read */
#define LPC54_I2C_INTENCLR_OFFSET   0x080c  /* Interrupt enable clear */
#define LPC54_I2C_TIMEOUT_OFFSET    0x0810  /* Time-out value */
#define LPC54_I2C_CLKDIV_OFFSET     0x0814  /* Clock pre-divider for the entire I2C interface */
#define LPC54_I2C_INTSTAT_OFFSET    0x0818  /* Interrupt status register for shared functions */

/* Master function registers */

#define LPC54_I2C_MSTCTL_OFFSET     0x0820  /* Master control */
#define LPC54_I2C_MSTTIME_OFFSET    0x0824  /* Master timing configuration */
#define LPC54_I2C_MSTDAT_OFFSET     0x0828  /* Combined Master receiver and transmitter data */

/* Slave function registers */

#define LPC54_I2C_SLVCTL_OFFSET     0x0840  /* Slave control */
#define LPC54_I2C_SLVDAT_OFFSET     0x0844  /* Combined Slave receiver and transmitter data */
#define LPC54_I2C_SLVADR0_OFFSET    0x0848  /* Slave address 0 */
#define LPC54_I2C_SLVADR1_OFFSET    0x084c  /* Slave address 1 */
#define LPC54_I2C_SLVADR2_OFFSET    0x0850  /* Slave address 2 */
#define LPC54_I2C_SLVADR3_OFFSET    0x0854  /* Slave address 3 */
#define LPC54_I2C_SLVQUAL0_OFFSET   0x0858  /* Slave qualification for address 0 */

/* Monitor function registers */

#define LPC54_I2C_MONRXDAT_OFFSET   0x0880  /* Monitor receiver data */

/* ID register */

#define LPC54_I2C_ID_OFFSET         0x0ffc  /* I2C module Identification */

/* Register addresses *******************************************************************************/

#define LPC54_I2C0_CFG              (LPC54_FLEXCOMM0_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C0_STAT             (LPC54_FLEXCOMM0_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C0_INTENSET         (LPC54_FLEXCOMM0_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C0_INTENCLR         (LPC54_FLEXCOMM0_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C0_TIMEOUT          (LPC54_FLEXCOMM0_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C0_CLKDIV           (LPC54_FLEXCOMM0_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C0_INTSTAT          (LPC54_FLEXCOMM0_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C0_MSTCTL           (LPC54_FLEXCOMM0_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C0_MSTTIME          (LPC54_FLEXCOMM0_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C0_MSTDAT           (LPC54_FLEXCOMM0_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C0_SLVCTL           (LPC54_FLEXCOMM0_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C0_SLVDAT           (LPC54_FLEXCOMM0_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C0_SLVADR0          (LPC54_FLEXCOMM0_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C0_SLVADR1          (LPC54_FLEXCOMM0_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C0_SLVADR2          (LPC54_FLEXCOMM0_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C0_SLVADR3          (LPC54_FLEXCOMM0_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C0_SLVQUAL0         (LPC54_FLEXCOMM0_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C0_MONRXDAT         (LPC54_FLEXCOMM0_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C0_ID               (LPC54_FLEXCOMM0_BASE + LPC54_I2C_ID_OFFSET

#define LPC54_I2C1_CFG              (LPC54_FLEXCOMM1_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C1_STAT             (LPC54_FLEXCOMM1_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C1_INTENSET         (LPC54_FLEXCOMM1_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C1_INTENCLR         (LPC54_FLEXCOMM1_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C1_TIMEOUT          (LPC54_FLEXCOMM1_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C1_CLKDIV           (LPC54_FLEXCOMM1_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C1_INTSTAT          (LPC54_FLEXCOMM1_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C1_MSTCTL           (LPC54_FLEXCOMM1_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C1_MSTTIME          (LPC54_FLEXCOMM1_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C1_MSTDAT           (LPC54_FLEXCOMM1_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C1_SLVCTL           (LPC54_FLEXCOMM1_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C1_SLVDAT           (LPC54_FLEXCOMM1_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C1_SLVADR0          (LPC54_FLEXCOMM1_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C1_SLVADR1          (LPC54_FLEXCOMM1_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C1_SLVADR2          (LPC54_FLEXCOMM1_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C1_SLVADR3          (LPC54_FLEXCOMM1_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C1_SLVQUAL0         (LPC54_FLEXCOMM1_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C1_MONRXDAT         (LPC54_FLEXCOMM1_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C1_ID               (LPC54_FLEXCOMM1_BASE + LPC54_I2C_ID_OFFSET

#define LPC54_I2C2_CFG              (LPC54_FLEXCOMM2_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C2_STAT             (LPC54_FLEXCOMM2_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C2_INTENSET         (LPC54_FLEXCOMM2_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C2_INTENCLR         (LPC54_FLEXCOMM2_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C2_TIMEOUT          (LPC54_FLEXCOMM2_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C2_CLKDIV           (LPC54_FLEXCOMM2_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C2_INTSTAT          (LPC54_FLEXCOMM2_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C2_MSTCTL           (LPC54_FLEXCOMM2_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C2_MSTTIME          (LPC54_FLEXCOMM2_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C2_MSTDAT           (LPC54_FLEXCOMM2_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C2_SLVCTL           (LPC54_FLEXCOMM2_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C2_SLVDAT           (LPC54_FLEXCOMM2_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C2_SLVADR0          (LPC54_FLEXCOMM2_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C2_SLVADR1          (LPC54_FLEXCOMM2_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C2_SLVADR2          (LPC54_FLEXCOMM2_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C2_SLVADR3          (LPC54_FLEXCOMM2_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C2_SLVQUAL0         (LPC54_FLEXCOMM2_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C2_MONRXDAT         (LPC54_FLEXCOMM2_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C2_ID               (LPC54_FLEXCOMM2_BASE + LPC54_I2C_ID_OFFSET

