apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_i2c.h
#define LPC54_I2C3_CFG              (LPC54_FLEXCOMM3_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C3_STAT             (LPC54_FLEXCOMM3_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C3_INTENSET         (LPC54_FLEXCOMM3_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C3_INTENCLR         (LPC54_FLEXCOMM3_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C3_TIMEOUT          (LPC54_FLEXCOMM3_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C3_CLKDIV           (LPC54_FLEXCOMM3_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C3_INTSTAT          (LPC54_FLEXCOMM3_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C3_MSTCTL           (LPC54_FLEXCOMM3_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C3_MSTTIME          (LPC54_FLEXCOMM3_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C3_MSTDAT           (LPC54_FLEXCOMM3_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C3_SLVCTL           (LPC54_FLEXCOMM3_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C3_SLVDAT           (LPC54_FLEXCOMM3_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C3_SLVADR0          (LPC54_FLEXCOMM3_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C3_SLVADR1          (LPC54_FLEXCOMM3_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C3_SLVADR2          (LPC54_FLEXCOMM3_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C3_SLVADR3          (LPC54_FLEXCOMM3_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C3_SLVQUAL0         (LPC54_FLEXCOMM3_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C3_MONRXDAT         (LPC54_FLEXCOMM3_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C3_ID               (LPC54_FLEXCOMM3_BASE + LPC54_I2C_ID_OFFSET

#define LPC54_I2C4_CFG              (LPC54_FLEXCOMM4_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C4_STAT             (LPC54_FLEXCOMM4_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C4_INTENSET         (LPC54_FLEXCOMM4_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C4_INTENCLR         (LPC54_FLEXCOMM4_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C4_TIMEOUT          (LPC54_FLEXCOMM4_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C4_CLKDIV           (LPC54_FLEXCOMM4_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C4_INTSTAT          (LPC54_FLEXCOMM4_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C4_MSTCTL           (LPC54_FLEXCOMM4_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C4_MSTTIME          (LPC54_FLEXCOMM4_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C4_MSTDAT           (LPC54_FLEXCOMM4_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C4_SLVCTL           (LPC54_FLEXCOMM4_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C4_SLVDAT           (LPC54_FLEXCOMM4_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C4_SLVADR0          (LPC54_FLEXCOMM4_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C4_SLVADR1          (LPC54_FLEXCOMM4_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C4_SLVADR2          (LPC54_FLEXCOMM4_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C4_SLVADR3          (LPC54_FLEXCOMM4_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C4_SLVQUAL0         (LPC54_FLEXCOMM4_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C4_MONRXDAT         (LPC54_FLEXCOMM4_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C4_ID               (LPC54_FLEXCOMM4_BASE + LPC54_I2C_ID_OFFSET

#define LPC54_I2C5_CFG              (LPC54_FLEXCOMM5_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C5_STAT             (LPC54_FLEXCOMM5_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C5_INTENSET         (LPC54_FLEXCOMM5_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C5_INTENCLR         (LPC54_FLEXCOMM5_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C5_TIMEOUT          (LPC54_FLEXCOMM5_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C5_CLKDIV           (LPC54_FLEXCOMM5_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C5_INTSTAT          (LPC54_FLEXCOMM5_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C5_MSTCTL           (LPC54_FLEXCOMM5_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C5_MSTTIME          (LPC54_FLEXCOMM5_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C5_MSTDAT           (LPC54_FLEXCOMM5_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C5_SLVCTL           (LPC54_FLEXCOMM5_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C5_SLVDAT           (LPC54_FLEXCOMM5_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C5_SLVADR0          (LPC54_FLEXCOMM5_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C5_SLVADR1          (LPC54_FLEXCOMM5_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C5_SLVADR2          (LPC54_FLEXCOMM5_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C5_SLVADR3          (LPC54_FLEXCOMM5_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C5_SLVQUAL0         (LPC54_FLEXCOMM5_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C5_MONRXDAT         (LPC54_FLEXCOMM5_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C5_ID               (LPC54_FLEXCOMM5_BASE + LPC54_I2C_ID_OFFSET

#define LPC54_I2C6_CFG              (LPC54_FLEXCOMM6_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C6_STAT             (LPC54_FLEXCOMM6_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C6_INTENSET         (LPC54_FLEXCOMM6_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C6_INTENCLR         (LPC54_FLEXCOMM6_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C6_TIMEOUT          (LPC54_FLEXCOMM6_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C6_CLKDIV           (LPC54_FLEXCOMM6_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C6_INTSTAT          (LPC54_FLEXCOMM6_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C6_MSTCTL           (LPC54_FLEXCOMM6_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C6_MSTTIME          (LPC54_FLEXCOMM6_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C6_MSTDAT           (LPC54_FLEXCOMM6_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C6_SLVCTL           (LPC54_FLEXCOMM6_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C6_SLVDAT           (LPC54_FLEXCOMM6_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C6_SLVADR0          (LPC54_FLEXCOMM6_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C6_SLVADR1          (LPC54_FLEXCOMM6_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C6_SLVADR2          (LPC54_FLEXCOMM6_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C6_SLVADR3          (LPC54_FLEXCOMM6_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C6_SLVQUAL0         (LPC54_FLEXCOMM6_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C6_MONRXDAT         (LPC54_FLEXCOMM6_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C6_ID               (LPC54_FLEXCOMM6_BASE + LPC54_I2C_ID_OFFSET

#define LPC54_I2C7_CFG              (LPC54_FLEXCOMM7_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C7_STAT             (LPC54_FLEXCOMM7_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C7_INTENSET         (LPC54_FLEXCOMM7_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C7_INTENCLR         (LPC54_FLEXCOMM7_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C7_TIMEOUT          (LPC54_FLEXCOMM7_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C7_CLKDIV           (LPC54_FLEXCOMM7_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C7_INTSTAT          (LPC54_FLEXCOMM7_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C7_MSTCTL           (LPC54_FLEXCOMM7_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C7_MSTTIME          (LPC54_FLEXCOMM7_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C7_MSTDAT           (LPC54_FLEXCOMM7_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C7_SLVCTL           (LPC54_FLEXCOMM7_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C7_SLVDAT           (LPC54_FLEXCOMM7_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C7_SLVADR0          (LPC54_FLEXCOMM7_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C7_SLVADR1          (LPC54_FLEXCOMM7_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C7_SLVADR2          (LPC54_FLEXCOMM7_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C7_SLVADR3          (LPC54_FLEXCOMM7_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C7_SLVQUAL0         (LPC54_FLEXCOMM7_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C7_MONRXDAT         (LPC54_FLEXCOMM7_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C7_ID               (LPC54_FLEXCOMM7_BASE + LPC54_I2C_ID_OFFSET

#define LPC54_I2C8_CFG              (LPC54_FLEXCOMM8_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C8_STAT             (LPC54_FLEXCOMM8_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C8_INTENSET         (LPC54_FLEXCOMM8_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C8_INTENCLR         (LPC54_FLEXCOMM8_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C8_TIMEOUT          (LPC54_FLEXCOMM8_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C8_CLKDIV           (LPC54_FLEXCOMM8_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C8_INTSTAT          (LPC54_FLEXCOMM8_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C8_MSTCTL           (LPC54_FLEXCOMM8_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C8_MSTTIME          (LPC54_FLEXCOMM8_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C8_MSTDAT           (LPC54_FLEXCOMM8_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C8_SLVCTL           (LPC54_FLEXCOMM8_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C8_SLVDAT           (LPC54_FLEXCOMM8_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C8_SLVADR0          (LPC54_FLEXCOMM8_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C8_SLVADR1          (LPC54_FLEXCOMM8_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C8_SLVADR2          (LPC54_FLEXCOMM8_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C8_SLVADR3          (LPC54_FLEXCOMM8_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C8_SLVQUAL0         (LPC54_FLEXCOMM8_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C8_MONRXDAT         (LPC54_FLEXCOMM8_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C8_ID               (LPC54_FLEXCOMM8_BASE + LPC54_I2C_ID_OFFSET

