apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_i2c.h
#define LPC54_I2C9_CFG              (LPC54_FLEXCOMM9_BASE + LPC54_I2C_CFG_OFFSET)
#define LPC54_I2C9_STAT             (LPC54_FLEXCOMM9_BASE + LPC54_I2C_STAT_OFFSET)
#define LPC54_I2C9_INTENSET         (LPC54_FLEXCOMM9_BASE + LPC54_I2C_INTENSET_OFFSET)
#define LPC54_I2C9_INTENCLR         (LPC54_FLEXCOMM9_BASE + LPC54_I2C_INTENCLR_OFFSET)
#define LPC54_I2C9_TIMEOUT          (LPC54_FLEXCOMM9_BASE + LPC54_I2C_TIMEOUT_OFFSET)
#define LPC54_I2C9_CLKDIV           (LPC54_FLEXCOMM9_BASE + LPC54_I2C_CLKDIV_OFFSET)
#define LPC54_I2C9_INTSTAT          (LPC54_FLEXCOMM9_BASE + LPC54_I2C_INTSTAT_OFFSET)
#define LPC54_I2C9_MSTCTL           (LPC54_FLEXCOMM9_BASE + LPC54_I2C_MSTCTL_OFFSET)
#define LPC54_I2C9_MSTTIME          (LPC54_FLEXCOMM9_BASE + LPC54_I2C_MSTTIME_OFFSET)
#define LPC54_I2C9_MSTDAT           (LPC54_FLEXCOMM9_BASE + LPC54_I2C_MSTDAT_OFFSET)
#define LPC54_I2C9_SLVCTL           (LPC54_FLEXCOMM9_BASE + LPC54_I2C_SLVCTL_OFFSET)
#define LPC54_I2C9_SLVDAT           (LPC54_FLEXCOMM9_BASE + LPC54_I2C_SLVDAT_OFFSET)
#define LPC54_I2C9_SLVADR0          (LPC54_FLEXCOMM9_BASE + LPC54_I2C_SLVADR0_OFFSET)
#define LPC54_I2C9_SLVADR1          (LPC54_FLEXCOMM9_BASE + LPC54_I2C_SLVADR1_OFFSET)
#define LPC54_I2C9_SLVADR2          (LPC54_FLEXCOMM9_BASE + LPC54_I2C_SLVADR2_OFFSET)
#define LPC54_I2C9_SLVADR3          (LPC54_FLEXCOMM9_BASE + LPC54_I2C_SLVADR3_OFFSET)
#define LPC54_I2C9_SLVQUAL0         (LPC54_FLEXCOMM9_BASE + LPC54_I2C_SLVQUAL0_OFFSET)
#define LPC54_I2C9_MONRXDAT         (LPC54_FLEXCOMM9_BASE + LPC54_I2C_MONRXDAT_OFFSET)
#define LPC54_I2C9_ID               (LPC54_FLEXCOMM9_BASE + LPC54_I2C_ID_OFFSET

/* Register bit definitions *************************************************************************/

/* Configuration for shared functions */

#define I2C_CFG_MSTEN               (1 << 0)  /* Bit 0:  Master enable */
#define I2C_CFG_SLVEN               (1 << 1)  /* Bit 1:  Slave enable */
#define I2C_CFG_MONEN               (1 << 2)  /* Bit 2:  Monitor enable */
#define I2C_CFG_TIMEOUTEN           (1 << 3)  /* Bit 3:  I2C bus time-out enable */
#define I2C_CFG_MONCLKSTR           (1 << 4)  /* Bit 4:  Monitor function clock stretching */
#define I2C_CFG_HSCAPABLE           (1 << 5)  /* Bit 5:  High-speed mode capable enable */

#define I2C_CFG_ALLENABLES          0x1f

/* Status, set and write, and clear register for shared functions */
/* Master function state codes (MSTSTATE) */

#define I2C_MASTER_STATE_IDLE       (0)       /* Idle */
#define I2C_MASTER_STATE_RXAVAIL    (1)       /* Received data is available (Master Receiver mode) */
#define I2C_MASTER_STATE_TXOK       (2)       /* Data can be transmitted (Master Transmitter mode) */
#define I2C_MASTER_STATE_ADDRNAK    (3)       /* Slave NACKed address */
#define I2C_MASTER_STATE_DATANAK    (4)       /* Slave NACKed transmitted data */

/* Slave function state codes (SLVSTATE) */

#define I2C_SLAVE_STATE_ADDR        (0)       /* Address plus R/W received */
#define I2C_SLAVE_STATE_RXAVAIL     (1)       /* Received data is available (Slave Receiver mode) */
#define I2C_SLAVE_STATE_TXOK        (2)       /* Data can be transmitted (Slave Transmitter mode) */

#define I2C_INT_MSTPENDING          (1 << 0)  /* Bit 0  Master Pending interrupt */
#define I2C_STAT_MSTSTATE_SHIFT     (1)       /* Bits 1-3: Master State code (status only) */
#define I2C_STAT_MSTSTATE_MASK      (7 << I2C_STAT_MSTSTATE_SHIFT)
#  define I2C_STAT_MSTSTATE_IDLE    (0 << I2C_STAT_MSTSTATE_SHIFT) /* Idle */
#  define I2C_STAT_MSTSTATE_RXAVAIL (1 << I2C_STAT_MSTSTATE_SHIFT) /* Receive ready */
#  define I2C_STAT_MSTSTATE_TXOK    (2 << I2C_STAT_MSTSTATE_SHIFT) /* Transmit ready */
#  define I2C_STAT_MSTSTATE_ADDRNAK (3 << I2C_STAT_MSTSTATE_SHIFT) /* NACK Address */
#  define I2C_STAT_MSTSTATE_DATANAK (4 << I2C_STAT_MSTSTATE_SHIFT) /* NACK Data */
#define I2C_INT_MSTARBLOSS          (1 << 4)  /* Bit 4:  Master Arbitration Loss interrupt */
#define I2C_INT_MSTSTSTPERR         (1 << 6)  /* Bit 6:  Master Start/Stop Error interrupt */
#define I2C_INT_SLVPENDING          (1 << 8)  /* Bit 8:  Slave Pending interrupt */
#define I2C_STAT_SLVSTATE_SHIFT     (9)       /* Bits 9-10: Slave State code (status only) */
#define I2C_STAT_SLVSTATE_MASK      (3 << I2C_STAT_SLVSTATE_SHIFT)
#  define I2C_STAT_SLVSTATE_ADDR    (0 << I2C_STAT_SLVSTATE_SHIFT) /* Slave address */
#  define I2C_STAT_SLVSTATE_RXAVAIL (1 << I2C_STAT_SLVSTATE_SHIFT) /* Slave receive */
#  define I2C_STAT_SLVSTATE_TXOK    (2 << I2C_STAT_SLVSTATE_SHIFT) /* Slave transmit */
#define I2C_INT_SLVNOTSTR           (1 << 11) /* Bit 11: Slave Not Stretching interrupt */
#define I2C_STAT_SLVIDX_SHIFT       (12)      /* Bits 12-13: Slave address match Index (status only) */
#define I2C_STAT_SLVIDX_MASK        (3 << I2C_STAT_SLVIDX_SHIFT)
#  define I2C_STAT_SLVIDX_ADDR0     (0 << I2C_STAT_SLVIDX_SHIFT) /* Slave address 0 was matched */
#  define I2C_STAT_SLVIDX_ADDR1     (1 << I2C_STAT_SLVIDX_SHIFT) /* Slave address 1 was matched */
#  define I2C_STAT_SLVIDX_ADDR2     (2 << I2C_STAT_SLVIDX_SHIFT) /* Slave address 2 was matched */
#  define I2C_STAT_SLVIDX_ADDR3     (3 << I2C_STAT_SLVIDX_SHIFT) /* Slave address 3 was matched */
#define I2C_STAT_SLVSEL             (1 << 14) /* Bit 14: Slave selected flag (Slave only) */
#define I2C_INT_SLVDESEL            (1 << 15) /* Bit 15: Slave Deselect interrupt */
#define I2C_INT_MONRDY              (1 << 16) /* Bit 16: Monitor data Ready interrupt */
#define I2C_INT_MONOV               (1 << 17) /* Bit 17: Monitor Overrun interrupt */
#define I2C_STAT_MONACTIVE          (1 << 18) /* Bit 18: Monitor Active flag (status only) */
#define I2C_INT_MONIDLE             (1 << 19) /* Bit 19: Monitor Idle interrupt */
#define I2C_INT_EVENTTIMEOUT        (1 << 24) /* Bit 24: Event time-out interrupt */
#define I2C_INT_SCLTIMEOUT          (1 << 25) /* Bit 25: SCL time-out interrupt */

#define I2C_INT_MSTPENDING          (1 << 0)  /* Bit 0  Master Pending interrupt */
#define I2C_INT_MSTARBLOSS          (1 << 4)  /* Bit 4:  Master Arbitration Loss interrupt */
#define I2C_INT_MSTSTSTPERR         (1 << 6)  /* Bit 6:  Master Start/Stop Error interrupt */
#define I2C_INT_SLVPENDING          (1 << 8)  /* Bit 8:  Slave Pending interrupt */
#define I2C_INT_SLVNOTSTR           (1 << 11) /* Bit 11: Slave Not Stretching interrupt */
#define I2C_INT_SLVDESEL            (1 << 15) /* Bit 15: Slave Deselect interrupt */
#define I2C_INT_MONRDY              (1 << 16) /* Bit 16: Monitor data Ready interrupt */
#define I2C_INT_MONOV               (1 << 17) /* Bit 17: Monitor Overrun interrupt */
#define I2C_INT_MONIDLE             (1 << 19) /* Bit 19: Monitor Idle interrupt */
#define I2C_INT_EVENTTIMEOUT        (1 << 24) /* Bit 24: Event time-out interrupt */
#define I2C_INT_SCLTIMEOUT          (1 << 25) /* Bit 25: SCL time-out interrupt */

#define I2C_INT_ALL                 0x030b8951

/* Time-out value */
#define I2C_TIMEOUT_

/* Clock pre-divider for the entire I2C interface */

