apache/nuttx/arch/arm/src/lpc54xx/chip/lpc54_i2c.h
#define I2C_CLKDIV_SHIFT            (0)       /* Bits 0-15: I2C clock divider */
#define I2C_CLKDIV_MASK             (0xffff << I2C_CLKDIV_SHIFT)
#  define I2C_CLKDIV(n)             ((uint32_t)((n)-1) << I2C_CLKDIV_SHIFT)

/* Interrupt status register for shared functions */
#define I2C_INTSTAT_

/* Master control */

#define I2C_MSTCTL_MSTCONTINUE      (1 << 0)  /* Bit 0:  Master Continue */
#define I2C_MSTCTL_MSTSTART         (1 << 1)  /* Bit 1:  Master Start control */
#define I2C_MSTCTL_MSTSTOP          (1 << 2)  /* Bit 2:  Master Stop control */
#define I2C_MSTCTL_MSTDMA           (1 << 3)  /* Bit 3:  Master DMA enable */

/* Master timing configuration */

#define I2C_MSTTIME_SCLLOW_SHIFT    (0)       /* Bits 0-2  Master SCL Low time */
#define I2C_MSTTIME_SCLLOW_MASK     (7 << I2C_MSTTIME_SCLLOW_SHIFT)
#  define I2C_MSTTIME_SCLLOW(n)     ((uint32_t)((n)-2) << I2C_MSTTIME_SCLLOW_SHIFT)
#define I2C_MSTTIME_SCLHIGH_SHIFT   (4)       /* Bits 4-6  Master SCL High time */
#define I2C_MSTTIME_SCLHIGH_MASK    (7 << I2C_MSTTIME_SCLHIGH_SHIFT)
#  define I2C_MSTTIME_SCLHIGH(n)    ((uint32_t)((n)-2) << I2C_MSTTIME_SCLHIGH_SHIFT)

/* Combined Master receiver and transmitter data */
#define I2C_MSTDAT_
/* Slave control */
#define I2C_SLVCTL_
/* Combined Slave receiver and transmitter data */
#define I2C_SLVDAT_
/* Slave address 0 */
#define I2C_SLVADR0_
/* Slave address 1 */
#define I2C_SLVADR1_
/* Slave address 2 */
#define I2C_SLVADR2_
/* Slave address 3 */
#define I2C_SLVADR3_
/* Slave qualification for address 0 */
#define I2C_SLVQUAL0_
/* Monitor receiver data */
#define I2C_MONRXDAT_
/* I2C module Identification */
#define I2C_ID_

#endif /* __ARCH_ARM_SRC_LPC54XX_CHIP_LPC54_I2C_H */
